app/controllers/bizs_controller.rb

SELECT * FROM `bizs`
---
  def index
    @bizs = Biz.all

SELECT * FROM `bizs` WHERE (`bizs`.`id` = 1)
---
  def show
    @biz = Biz.find(params[:id])

SELECT * FROM `bizs` WHERE (`bizs`.`id` = 9)
---
  def edit
    @biz = Biz.find(params[:id])

INSERT INTO `bizs` (`name`, `head`, `shopfront`, `headMsn`, `updated_at`, `headPhone`, `url`, `headQQ`, `transferTation`, `area`, `description`, `headEmail`, `tradingArea`, `phone1`, `address`, `created_at`) VALUES('asdfasdf', 'adfdf', 'asdfas', 'adfdf', '2010-05-20 05:08:34', 'adfadf', 'dafdfd', 'adfdafdf', 'adfadf', 'adf', 'asdfasdfad', 'adfadfd', 'adfa', 'adfd', 'ddadfd', '2010-05-20 05:08:34')
---
  def create
    @biz = Biz.new(params[:biz])

    respond_to do |format|
      if @biz.save

SELECT * FROM `bizs` WHERE (`bizs`.`id` = 9)
UPDATE `bizs` SET `shopfront` = '尚品宠物-富贵园店策划似乎', `updated_at` = '2010-05-21 06:36:33' WHERE `id` = 9
---
  def update
    @biz = Biz.find(params[:id])

    respond_to do |format|
      if @biz.update_attributes(params[:biz])